app/services/dashboard_stats_service.rb

  def resource_usage_data
    {
      venues: @tenant.venues.map { |v| { name: v.name, usage_count: v.booking_count || 0 } },
      equipments: @tenant.equipments.map { |e| { name: e.name, usage_count: e.usage_count || 0 } }
---
SELECT "equipment".* FROM "equipment" WHERE "equipment"."tenant_id" = 1
SELECT "venues".* FROM "venues" WHERE "venues"."tenant_id" = 1