app/services/dashboard_stats_service.rb

  def resource_usage_data
    venue_usage_counts = Booking.where(bookable_type: "Venue")
                               .where.not(status: "rejected")
                               .group(:bookable_id)
                               .count

    equipment_usage_counts = Booking.where(bookable_type: "Equipment")
                                   .where.not(status: "rejected")
                                   .group(:bookable_id)
                                   .count
---
SELECT COUNT(*) FROM "bookings" WHERE "bookings"."bookable_type" = 'Venue' AND "bookings"."bookable_id" = 1 AND "bookings"."status" = 'approved'