app/views/search/index.html.haml

SELECT "equipment".* FROM "equipment" WHERE (LOWER(name) LIKE '%projector%')
---
        .equipment-results-list
          - @equipment_results.each do |equipment|
            .result-card.equipment-card