app/views/bookings/new.html.haml

SELECT "time_slots".* FROM "time_slots" WHERE "time_slots"."id" IS NULL LIMIT 1
---
%p Time Slot: git status
- time_slot = TimeSlot.find(@time_slot_id)