app/views/buildings/show.html.erb

      <ul>
        <% venue.time_slots.each do |slot| %>
---
SELECT "time_slots".* FROM "time_slots" WHERE "time_slots"."venue_id" = ?  [["venue_id", 1]]