app/views/buildings/show.html.erb

        <div style="padding: 14px 18px;">
          <% slots = venue.time_slots.order(:start_time) %>
---
SELECT "time_slots".* FROM "time_slots" WHERE "time_slots"."venue_id" = ? ORDER BY "time_slots"."start_time" ASC  [["venue_id", 1]]