app/controllers/bookings_controller.rb

SELECT "venues".* FROM "venues"
---
  def venue
    @rooms = Venue.all

SELECT "equipment".* FROM "equipment"
SELECT "time_slots".* FROM "time_slots" ORDER BY "time_slots"."start_time" ASC
---
  def equipment
    @equipments = Equipment.all
    @time_slots = TimeSlot.order(:start_time)

SELECT "time_slots".* FROM "time_slots" WHERE "time_slots"."id" = 1 LIMIT 1
---
  def new
    @booking = Booking.new
    @bookable_id = params[:bookable_id]
    @bookable_type = params[:bookable_type]
    @time_slot_id = params[:time_slot_id]
    @time_slot = TimeSlot.find_by(id: @time_slot_id)

    return unless requires_time_slot?(@bookable_type)
    return if @time_slot.present?

INSERT INTO "bookings" ("user_id", "bookable_type", "bookable_id", "start_time", "end_time", "status", "created_at", "updated_at", "time_slot_id") VALUES (3, 'Equipment', 1, '2000-01-01 09:00:00', '2000-01-01 10:00:00', 'pending', '2026-04-10 07:50:05.657252', '2026-04-10 07:50:05.657252', 1) RETURNING "id"
---
  def create
    @booking = Booking.new(booking_params)
    @booking.user = current_user
    @booking.status = "pending"
    assign_booking_times_from_time_slot(@booking)

    if Booking.new_conflict?(@booking.bookable_id, @booking.bookable_type, @booking.start_time, @booking.end_time)
      redirect_to "/bookings/new", alert: "Unavailable time slot"
    elsif @booking.save

SELECT "bookings".* FROM "bookings" WHERE "bookings"."id" = 4 LIMIT 1
---
  def show
    @booking = Booking.find(params[:id])

SELECT "bookings".* FROM "bookings" WHERE "bookings"."user_id" = 3 AND (bookable_type = 'Equipment' AND bookable_id IN (3, 8, 13) OR bookable_type = 'Venue' AND bookable_id IN (NULL)) ORDER BY "bookings"."created_at" DESC
SELECT "equipment"."id" FROM "equipment" WHERE (LOWER(name) LIKE '%speaker%')
SELECT "venues"."id" FROM "venues" WHERE (LOWER(name) LIKE '%speaker%')
---
  def index
    @bookings = current_user.bookings.order(created_at: :desc)
    @search_query = params[:q]

    if @search_query.present?
      query = "%#{@search_query.downcase}%"
      equipment_ids = Equipment.where("LOWER(name) LIKE ?", query).pluck(:id)
      venue_ids = Venue.where("LOWER(name) LIKE ?", query).pluck(:id)

SELECT "bookings".* FROM "bookings" WHERE "bookings"."id" = 1 LIMIT 1
DELETE FROM "bookings" WHERE "bookings"."id" = 1
---
  def destroy
    @booking = Booking.find(params[:id])
    if @booking.user == current_user
      if @booking.destroy

SELECT "time_slots".* FROM "time_slots" WHERE "time_slots"."id" = 2 LIMIT 1
---
  def assign_booking_times_from_time_slot(booking)
    return if booking.time_slot_id.blank?

    time_slot = TimeSlot.find_by(id: booking.time_slot_id)