app/controllers/bookings_controller.rb

DELETE FROM "bookings" WHERE "bookings"."id" = 11
---
  def destroy
    @booking = Booking.find(params[:id])
    if @booking.user == current_user
      BookingMailer.deletion(@booking).deliver_later
      @booking.destroy

SELECT "time_slots".* FROM "time_slots" WHERE "time_slots"."id" = 1 LIMIT 1
SELECT "time_slots".* FROM "time_slots" WHERE "time_slots"."id" = 4 LIMIT 1
---
  def assign_booking_times_from_time_slot(booking)
    return if booking.time_slot_id.blank?

    time_slot = TimeSlot.find_by(id: booking.time_slot_id)
    return if time_slot.blank?