app/controllers/buildings_controller.rb

SELECT "locations".* FROM "locations"
SELECT "venues".* FROM "venues" INNER JOIN "locations" ON "locations"."id" = "venues"."location_id" WHERE "locations"."name" = 'New Asia College Gymnasium'
SELECT "time_slots".* FROM "time_slots" WHERE "time_slots"."venue_id" = ?  [["venue_id", 1]]
---
  def show
    slug = params[:slug].to_s
    @location = Location.all.find { |loc| slugify_location_name(loc.name) == slug }

    if @location.blank?
      redirect_to map_path, alert: "Location not found."
      return
    end

    @official_name = @location.name
    @venues = @location.venues.includes(:time_slots).order(:name)

    @selected_date = begin
      params[:booking_date].present? ? Date.parse(params[:booking_date].to_s) : Date.current
    rescue ArgumentError
      Date.current
    end

    # Build a set of [venue_id, slot_id] pairs that are already booked on the selected date
    venue_ids = @venues.map(&:id)