app/controllers/buildings_controller.rb

SELECT COUNT(*) FROM "venues" INNER JOIN "locations" ON "locations"."id" = "venues"."location_id" WHERE "locations"."name" = 'New Asia College Gymnasium'
---
  def show
    # Get the slug from the URL
    @slug = params[:slug]

    # Create a mapping of slugs to official names
    building_names = {
      "sirrunrunshawhall" => "Sir Run Run Shaw Hall",
      "nagym"             => "New Asia College Gymnasium",
      "ucgym"            => "United College Gymnasium",
      "lingnanstadium"    => "Lingnan Stadium",
      "usportscentre"     => "University Sports Centre",
      "shawtheatre"       => "Shaw College Lecture Theatre"
    }

    # Find the official name based on the slug
    # If the slug isn't found, default to "Unknown Building"
    @official_name = building_names[@slug] || "Unknown Building"

    #find the venue under this building
    @venues=Venue.joins(:location).where(locations: {name: @official_name})
    puts "DEBUG: @official_name = #{@official_name}"
    puts "DEBUG: @venues count = #{@venues.count}"