app/controllers/dashboards_controller.rb

  def index
    @tenants = Tenant.all
    selected_tenant_id = params[:tenant_id].presence
    @selected_tenant = selected_tenant_id ? Tenant.find_by(id: selected_tenant_id) : Tenant.first
---
SELECT "tenants".* FROM "tenants" ORDER BY "tenants"."id" ASC LIMIT 1
SELECT "tenants".* FROM "tenants" WHERE "tenants"."id" = 1 LIMIT 1