app/controllers/passwords_controller.rb

  def update
    @user = current_user

    if @user.authenticate(params[:password_current])
      if @user.update(password: params[:password], password_confirmation: params[:password_confirmation])
---
UPDATE "users" SET "updated_at" = '2026-04-09 22:30:05.680022', "password_digest" = '$2a$12$.3/6u/VRanL/HpMAsBC4eOwNTWwLe6maY221PyCYAaSuEc0watw1G' WHERE "users"."id" = 3