app/controllers/registrations_controller.rb

INSERT INTO "users" ("email", "name", "role", "tenant_id", "created_at", "updated_at", "password_digest") VALUES ('1155213294@link.cuhk.edu.hk', 'HO Chi Tung', NULL, 1, '2026-04-08 14:18:54.001966', '2026-04-08 14:18:54.001966', '$2a$12$CHGuqC4DmCtK8GCQ7dynoeP9xDzwlzX8gxfLQsH8jS7wqlgic4zKq') RETURNING "id"
---
  def create
    @user = User.new(user_params)

    if @user.save