app/controllers/search_controller.rb

  def index
    @query = params[:q]
    @time_slots = TimeSlot.order(:start_time)

    if @query.present?
      @equipment_results = Equipment.where("LOWER(name) LIKE ?", "%#{@query.downcase}%")
---
SELECT "time_slots".* FROM "time_slots" ORDER BY "time_slots"."start_time" ASC
SELECT "equipment".* FROM "equipment" WHERE (LOWER(name) LIKE '%projectoraa%')