app/models/booking.rb

  def self.new_conflict?(bookable_id, bookable_type, start_time, end_time)
    where(bookable_id: bookable_id,  bookable_type: bookable_type,  status: "approved") #key: value
    .where("start_time <? AND end_time >?" , end_time, start_time)
    .exists?
---
SELECT 1 AS one FROM "bookings" WHERE "bookings"."bookable_id" = 1 AND "bookings"."bookable_type" = 'Equipment' AND "bookings"."status" = 'approved' AND (start_time <NULL AND end_time >NULL) LIMIT 1